/***************************************************************************
 *                                                                         *
 *          ###########   ###########   ##########    ##########           *
 *         ############  ############  ############  ############          *
 *         ##            ##            ##   ##   ##  ##        ##          *
 *         ##            ##            ##   ##   ##  ##        ##          *
 *         ###########   ####  ######  ##   ##   ##  ##    ######          *
 *          ###########  ####  #       ##   ##   ##  ##    #    #          *
 *                   ##  ##    ######  ##   ##   ##  ##    #    #          *
 *                   ##  ##    #       ##   ##   ##  ##    #    #          *
 *         ############  ##### ######  ##   ##   ##  ##### ######          *
 *         ###########    ###########  ##   ##   ##   ##########           *
 *                                                                         *
 *            S E C U R E   M O B I L E   N E T W O R K I N G              *
 *                                                                         *
 * This file is part of NexMon.                                            *
 *                                                                         *
 * Copyright (c) 2025 NexMon Team                                          *
 *                                                                         *
 * NexMon is free software: you can redistribute it and/or modify          *
 * it under the terms of the GNU General Public License as published by    *
 * the Free Software Foundation, either version 3 of the License, or       *
 * (at your option) any later version.                                     *
 *                                                                         *
 * NexMon is distributed in the hope that it will be useful,               *
 * but WITHOUT ANY WARRANTY; without even the implied warranty of          *
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the           *
 * GNU General Public License for more details.                            *
 *                                                                         *
 * You should have received a copy of the GNU General Public License       *
 * along with NexMon. If not, see <http://www.gnu.org/licenses/>.          *
 *                                                                         *
 **************************************************************************/

#ifndef STRUCTS_COMMON_H
#define STRUCTS_COMMON_H

#include <types.h>

struct hnd_cons {
    uint   vcons_in;
    uint   vcons_out;
    char   *buf;
    uint   buf_size;
    uint   idx;
    uint   out_idx;
    uint   cbuf_idx;
    char   cbuf[];
} __attribute__((packed));

struct hnd_debug {
    uint32  magic;
    uint32  version;
    uint32  fwid;
    char    epivers[32];
    void    *trap_ptr;
    struct hnd_cons *console;
    uint32  ram_base;
    uint32  ram_size;
    uint32  rom_base;
    uint32  rom_size;
    void    *event_log_top;
} __attribute__((packed));

struct d11regs {
    uint32 PAD;                /* 0x000 */
    uint32 PAD;                /* 0x004 */
    uint32 PAD;                /* 0x008 */
    uint32 PAD;                /* 0x00c */
    uint32 PAD;                /* 0x010 */
    uint32 PAD;                /* 0x014 */
    uint32 PAD;                /* 0x018 */
    uint32 PAD;                /* 0x01c */
    uint32 PAD;                /* 0x020 */
    uint32 PAD;                /* 0x024 */
    uint32 PAD;                /* 0x028 */
    uint32 PAD;                /* 0x02c */
    uint32 PAD;                /* 0x030 */
    uint32 PAD;                /* 0x034 */
    uint32 PAD;                /* 0x038 */
    uint32 PAD;                /* 0x03c */
    uint32 PAD;                /* 0x040 */
    uint32 PAD;                /* 0x044 */
    uint32 PAD;                /* 0x048 */
    uint32 PAD;                /* 0x04c */
    uint32 PAD;                /* 0x050 */
    uint32 PAD;                /* 0x054 */
    uint32 PAD;                /* 0x058 */
    uint32 PAD;                /* 0x05c */
    uint32 PAD;                /* 0x060 */
    uint32 PAD;                /* 0x064 */
    uint32 PAD;                /* 0x068 */
    uint32 PAD;                /* 0x06c */
    uint32 PAD;                /* 0x070 */
    uint32 PAD;                /* 0x074 */
    uint32 PAD;                /* 0x078 */
    uint32 PAD;                /* 0x07c */
    uint32 PAD;                /* 0x080 */
    uint32 PAD;                /* 0x084 */
    uint32 PAD;                /* 0x088 */
    uint32 PAD;                /* 0x08c */
    uint32 PAD;                /* 0x090 */
    uint32 PAD;                /* 0x094 */
    uint32 PAD;                /* 0x098 */
    uint32 PAD;                /* 0x09c */
    uint32 PAD;                /* 0x0a0 */
    uint32 PAD;                /* 0x0a4 */
    uint32 PAD;                /* 0x0a8 */
    uint32 PAD;                /* 0x0ac */
    uint32 PAD;                /* 0x0b0 */
    uint32 PAD;                /* 0x0b4 */
    uint32 PAD;                /* 0x0b8 */
    uint32 PAD;                /* 0x0bc */
    uint32 PAD;                /* 0x0c0 */
    uint32 PAD;                /* 0x0c4 */
    uint32 PAD;                /* 0x0c8 */
    uint32 PAD;                /* 0x0cc */
    uint32 PAD;                /* 0x0d0 */
    uint32 PAD;                /* 0x0d4 */
    uint32 PAD;                /* 0x0d8 */
    uint32 PAD;                /* 0x0dc */
    uint32 PAD;                /* 0x0e0 */
    uint32 PAD;                /* 0x0e4 */
    uint32 PAD;                /* 0x0e8 */
    uint32 PAD;                /* 0x0ec */
    uint32 PAD;                /* 0x0f0 */
    uint32 PAD;                /* 0x0f4 */
    uint32 PAD;                /* 0x0f8 */
    uint32 PAD;                /* 0x0fc */
    uint32 PAD;                /* 0x100 */
    uint32 PAD;                /* 0x104 */
    uint32 PAD;                /* 0x108 */
    uint32 PAD;                /* 0x10c */
    uint32 PAD;                /* 0x110 */
    uint32 PAD;                /* 0x114 */
    uint32 PAD;                /* 0x118 */
    uint32 PAD;                /* 0x11c */
    uint32 PAD;                /* 0x120 */
    uint32 PAD;                /* 0x124 */
    uint32 PAD;                /* 0x128 */
    uint32 PAD;                /* 0x12c */
    uint32 PAD;                /* 0x130 */
    uint32 PAD;                /* 0x134 */
    uint32 PAD;                /* 0x138 */
    uint32 PAD;                /* 0x13c */
    uint32 PAD;                /* 0x140 */
    uint32 PAD;                /* 0x144 */
    uint32 PAD;                /* 0x148 */
    uint32 PAD;                /* 0x14c */
    uint32 PAD;                /* 0x150 */
    uint32 PAD;                /* 0x154 */
    uint32 PAD;                /* 0x158 */
    uint32 PAD;                /* 0x15c */
    uint32 objaddr;            /* 0x160 */
    uint32 objdata;            /* 0x164 */
    uint32 PAD;                /* 0x168 */
    uint32 PAD;                /* 0x16c */
    uint32 PAD;                /* 0x170 */
    uint32 PAD;                /* 0x174 */
    uint32 PAD;                /* 0x178 */
    uint32 PAD;                /* 0x17c */
    uint32 PAD;                /* 0x180 */
    uint32 PAD;                /* 0x184 */
    uint32 PAD;                /* 0x188 */
    uint32 PAD;                /* 0x18c */
    uint32 PAD;                /* 0x190 */
    uint32 PAD;                /* 0x194 */
    uint32 PAD;                /* 0x198 */
    uint32 PAD;                /* 0x19c */
    uint32 PAD;                /* 0x1a0 */
    uint32 PAD;                /* 0x1a4 */
    uint32 PAD;                /* 0x1a8 */
    uint32 PAD;                /* 0x1ac */
    uint32 PAD;                /* 0x1b0 */
    uint32 PAD;                /* 0x1b4 */
    uint32 PAD;                /* 0x1b8 */
    uint32 PAD;                /* 0x1bc */
    uint32 PAD;                /* 0x1c0 */
    uint32 PAD;                /* 0x1c4 */
    uint32 PAD;                /* 0x1c8 */
    uint32 PAD;                /* 0x1cc */
    uint32 PAD;                /* 0x1d0 */
    uint32 PAD;                /* 0x1d4 */
    uint32 PAD;                /* 0x1d8 */
    uint32 PAD;                /* 0x1dc */
    uint32 PAD;                /* 0x1e0 */
    uint32 PAD;                /* 0x1e4 */
    uint32 PAD;                /* 0x1e8 */
    uint32 PAD;                /* 0x1ec */
    uint32 PAD;                /* 0x1f0 */
    uint32 PAD;                /* 0x1f4 */
    uint32 PAD;                /* 0x1f8 */
    uint32 PAD;                /* 0x1fc */
    uint32 PAD;                /* 0x200 */
    uint32 PAD;                /* 0x204 */
    uint32 PAD;                /* 0x208 */
    uint32 PAD;                /* 0x20c */
    uint32 PAD;                /* 0x210 */
    uint32 PAD;                /* 0x214 */
    uint32 PAD;                /* 0x218 */
    uint32 PAD;                /* 0x21c */
    uint32 PAD;                /* 0x220 */
    uint32 PAD;                /* 0x224 */
    uint32 PAD;                /* 0x228 */
    uint32 PAD;                /* 0x22c */
    uint32 PAD;                /* 0x230 */
    uint32 PAD;                /* 0x234 */
    uint32 PAD;                /* 0x238 */
    uint32 PAD;                /* 0x23c */
    uint32 PAD;                /* 0x240 */
    uint32 PAD;                /* 0x244 */
    uint32 PAD;                /* 0x248 */
    uint32 PAD;                /* 0x24c */
    uint32 PAD;                /* 0x250 */
    uint32 PAD;                /* 0x254 */
    uint32 PAD;                /* 0x258 */
    uint32 PAD;                /* 0x25c */
    uint32 PAD;                /* 0x260 */
    uint32 PAD;                /* 0x264 */
    uint32 PAD;                /* 0x268 */
    uint32 PAD;                /* 0x26c */
    uint32 PAD;                /* 0x270 */
    uint32 PAD;                /* 0x274 */
    uint32 PAD;                /* 0x278 */
    uint32 PAD;                /* 0x27c */
    uint32 PAD;                /* 0x280 */
    uint32 PAD;                /* 0x284 */
    uint32 PAD;                /* 0x288 */
    uint32 PAD;                /* 0x28c */
    uint32 PAD;                /* 0x290 */
    uint32 PAD;                /* 0x294 */
    uint32 PAD;                /* 0x298 */
    uint32 PAD;                /* 0x29c */
    uint32 PAD;                /* 0x2a0 */
    uint32 PAD;                /* 0x2a4 */
    uint32 PAD;                /* 0x2a8 */
    uint32 PAD;                /* 0x2ac */
    uint32 PAD;                /* 0x2b0 */
    uint32 PAD;                /* 0x2b4 */
    uint32 PAD;                /* 0x2b8 */
    uint32 PAD;                /* 0x2bc */
    uint32 PAD;                /* 0x2c0 */
    uint32 PAD;                /* 0x2c4 */
    uint32 PAD;                /* 0x2c8 */
    uint32 PAD;                /* 0x2cc */
    uint32 PAD;                /* 0x2d0 */
    uint32 PAD;                /* 0x2d4 */
    uint32 PAD;                /* 0x2d8 */
    uint32 PAD;                /* 0x2dc */
    uint32 PAD;                /* 0x2e0 */
    uint32 PAD;                /* 0x2e4 */
    uint32 PAD;                /* 0x2e8 */
    uint32 PAD;                /* 0x2ec */
    uint32 PAD;                /* 0x2f0 */
    uint32 PAD;                /* 0x2f4 */
    uint32 PAD;                /* 0x2f8 */
    uint32 PAD;                /* 0x2fc */
    uint32 PAD;                /* 0x300 */
    uint32 PAD;                /* 0x304 */
    uint32 PAD;                /* 0x308 */
    uint32 PAD;                /* 0x30c */
    uint32 PAD;                /* 0x310 */
    uint32 PAD;                /* 0x314 */
    uint32 PAD;                /* 0x318 */
    uint32 PAD;                /* 0x31c */
    uint32 PAD;                /* 0x320 */
    uint32 PAD;                /* 0x324 */
    uint32 PAD;                /* 0x328 */
    uint32 PAD;                /* 0x32c */
    uint32 PAD;                /* 0x330 */
    uint32 PAD;                /* 0x334 */
    uint32 PAD;                /* 0x338 */
    uint32 PAD;                /* 0x33c */
    uint32 PAD;                /* 0x340 */
    uint32 PAD;                /* 0x344 */
    uint32 PAD;                /* 0x348 */
    uint32 PAD;                /* 0x34c */
    uint32 PAD;                /* 0x350 */
    uint32 PAD;                /* 0x354 */
    uint32 PAD;                /* 0x358 */
    uint32 PAD;                /* 0x35c */
    uint32 PAD;                /* 0x360 */
    uint32 PAD;                /* 0x364 */
    uint32 PAD;                /* 0x368 */
    uint32 PAD;                /* 0x36c */
    uint32 PAD;                /* 0x370 */
    uint32 PAD;                /* 0x374 */
    uint32 PAD;                /* 0x378 */
    uint32 PAD;                /* 0x37c */
    uint32 PAD;                /* 0x380 */
    uint32 PAD;                /* 0x384 */
    uint32 PAD;                /* 0x388 */
    uint32 PAD;                /* 0x38c */
    uint32 PAD;                /* 0x390 */
    uint32 PAD;                /* 0x394 */
    uint32 PAD;                /* 0x398 */
    uint32 PAD;                /* 0x39c */
    uint32 PAD;                /* 0x3a0 */
    uint32 PAD;                /* 0x3a4 */
    uint32 PAD;                /* 0x3a8 */
    uint32 PAD;                /* 0x3ac */
    uint32 PAD;                /* 0x3b0 */
    uint32 PAD;                /* 0x3b4 */
    uint32 PAD;                /* 0x3b8 */
    uint32 PAD;                /* 0x3bc */
    uint32 PAD;                /* 0x3c0 */
    uint32 PAD;                /* 0x3c4 */
    uint32 PAD;                /* 0x3c8 */
    uint32 PAD;                /* 0x3cc */
    uint32 PAD;                /* 0x3d0 */
    uint32 PAD;                /* 0x3d4 */
    uint32 PAD;                /* 0x3d8 */
    uint32 PAD;                /* 0x3dc */
    uint32 PAD;                /* 0x3e0 */
    uint32 PAD;                /* 0x3e4 */
    uint32 PAD;                /* 0x3e8 */
    uint32 PAD;                /* 0x3ec */
    uint32 PAD;                /* 0x3f0 */
    uint32 PAD;                /* 0x3f4 */
    uint32 PAD;                /* 0x3f8 */
    uint32 PAD;                /* 0x3fc */
    uint16 PAD;                /* 0x400 */
    uint16 PAD;                /* 0x402 */
    uint16 PAD;                /* 0x404 */
    uint16 PAD;                /* 0x406 */
    uint16 PAD;                /* 0x408 */
    uint16 PAD;                /* 0x40a */
    uint16 PAD;                /* 0x40c */
    uint16 PAD;                /* 0x40e */
    uint16 PAD;                /* 0x410 */
    uint16 PAD;                /* 0x412 */
    uint16 PAD;                /* 0x414 */
    uint16 PAD;                /* 0x416 */
    uint16 PAD;                /* 0x418 */
    uint16 PAD;                /* 0x41a */
    uint16 PAD;                /* 0x41c */
    uint16 PAD;                /* 0x41e */
    uint16 PAD;                /* 0x420 */
    uint16 PAD;                /* 0x422 */
    uint16 PAD;                /* 0x424 */
    uint16 PAD;                /* 0x426 */
    uint16 PAD;                /* 0x428 */
    uint16 PAD;                /* 0x42a */
    uint16 PAD;                /* 0x42c */
    uint16 PAD;                /* 0x42e */
    uint16 PAD;                /* 0x430 */
    uint16 PAD;                /* 0x432 */
    uint16 PAD;                /* 0x434 */
    uint16 PAD;                /* 0x436 */
    uint16 PAD;                /* 0x438 */
    uint16 PAD;                /* 0x43a */
    uint16 PAD;                /* 0x43c */
    uint16 PAD;                /* 0x43e */
    uint16 PAD;                /* 0x440 */
    uint16 PAD;                /* 0x442 */
    uint16 PAD;                /* 0x444 */
    uint16 PAD;                /* 0x446 */
    uint16 PAD;                /* 0x448 */
    uint16 PAD;                /* 0x44a */
    uint16 PAD;                /* 0x44c */
    uint16 PAD;                /* 0x44e */
    uint16 PAD;                /* 0x450 */
    uint16 PAD;                /* 0x452 */
    uint16 PAD;                /* 0x454 */
    uint16 PAD;                /* 0x456 */
    uint16 PAD;                /* 0x458 */
    uint16 PAD;                /* 0x45a */
    uint16 PAD;                /* 0x45c */
    uint16 PAD;                /* 0x45e */
    uint16 PAD;                /* 0x460 */
    uint16 PAD;                /* 0x462 */
    uint16 PAD;                /* 0x464 */
    uint16 PAD;                /* 0x466 */
    uint16 PAD;                /* 0x468 */
    uint16 PAD;                /* 0x46a */
    uint16 PAD;                /* 0x46c */
    uint16 PAD;                /* 0x46e */
    uint16 PAD;                /* 0x470 */
    uint16 PAD;                /* 0x472 */
    uint16 PAD;                /* 0x474 */
    uint16 PAD;                /* 0x476 */
    uint16 PAD;                /* 0x478 */
    uint16 PAD;                /* 0x47a */
    uint16 PAD;                /* 0x47c */
    uint16 PAD;                /* 0x47e */
    uint16 PAD;                /* 0x480 */
    uint16 PAD;                /* 0x482 */
    uint16 PAD;                /* 0x484 */
    uint16 PAD;                /* 0x486 */
    uint16 PAD;                /* 0x488 */
    uint16 PAD;                /* 0x48a */
    uint16 PAD;                /* 0x48c */
    uint16 PAD;                /* 0x48e */
    uint16 PAD;                /* 0x490 */
    uint16 PAD;                /* 0x492 */
    uint16 PAD;                /* 0x494 */
    uint16 PAD;                /* 0x496 */
    uint16 PAD;                /* 0x498 */
    uint16 PAD;                /* 0x49a */
    uint16 PAD;                /* 0x49c */
    uint16 PAD;                /* 0x49e */
    uint16 PAD;                /* 0x4a0 */
    uint16 PAD;                /* 0x4a2 */
    uint16 PAD;                /* 0x4a4 */
    uint16 PAD;                /* 0x4a6 */
    uint16 PAD;                /* 0x4a8 */
    uint16 PAD;                /* 0x4aa */
    uint16 PAD;                /* 0x4ac */
    uint16 PAD;                /* 0x4ae */
    uint16 PAD;                /* 0x4b0 */
    uint16 PAD;                /* 0x4b2 */
    uint16 PAD;                /* 0x4b4 */
    uint16 PAD;                /* 0x4b6 */
    uint16 PAD;                /* 0x4b8 */
    uint16 PAD;                /* 0x4ba */
    uint16 PAD;                /* 0x4bc */
    uint16 PAD;                /* 0x4be */
    uint16 PAD;                /* 0x4c0 */
    uint16 PAD;                /* 0x4c2 */
    uint16 PAD;                /* 0x4c4 */
    uint16 PAD;                /* 0x4c6 */
    uint16 PAD;                /* 0x4c8 */
    uint16 PAD;                /* 0x4ca */
    uint16 PAD;                /* 0x4cc */
    uint16 PAD;                /* 0x4ce */
    uint16 PAD;                /* 0x4d0 */
    uint16 PAD;                /* 0x4d2 */
    uint16 PAD;                /* 0x4d4 */
    uint16 PAD;                /* 0x4d6 */
    uint16 PAD;                /* 0x4d8 */
    uint16 PAD;                /* 0x4da */
    uint16 PAD;                /* 0x4dc */
    uint16 PAD;                /* 0x4de */
    uint16 PAD;                /* 0x4e0 */
    uint16 PAD;                /* 0x4e2 */
    uint16 PAD;                /* 0x4e4 */
    uint16 PAD;                /* 0x4e6 */
    uint16 PAD;                /* 0x4e8 */
    uint16 PAD;                /* 0x4ea */
    uint16 PAD;                /* 0x4ec */
    uint16 PAD;                /* 0x4ee */
    uint16 PAD;                /* 0x4f0 */
    uint16 PAD;                /* 0x4f2 */
    uint16 PAD;                /* 0x4f4 */
    uint16 PAD;                /* 0x4f6 */
    uint16 PAD;                /* 0x4f8 */
    uint16 PAD;                /* 0x4fa */
    uint16 PAD;                /* 0x4fc */
    uint16 PAD;                /* 0x4fe */
    uint16 PAD;                /* 0x500 */
    uint16 PAD;                /* 0x502 */
    uint16 PAD;                /* 0x504 */
    uint16 PAD;                /* 0x506 */
    uint16 PAD;                /* 0x508 */
    uint16 PAD;                /* 0x50a */
    uint16 PAD;                /* 0x50c */
    uint16 PAD;                /* 0x50e */
    uint16 PAD;                /* 0x510 */
    uint16 PAD;                /* 0x512 */
    uint16 PAD;                /* 0x514 */
    uint16 PAD;                /* 0x516 */
    uint16 PAD;                /* 0x518 */
    uint16 PAD;                /* 0x51a */
    uint16 PAD;                /* 0x51c */
    uint16 PAD;                /* 0x51e */
    uint16 PAD;                /* 0x520 */
    uint16 PAD;                /* 0x522 */
    uint16 PAD;                /* 0x524 */
    uint16 PAD;                /* 0x526 */
    uint16 PAD;                /* 0x528 */
    uint16 PAD;                /* 0x52a */
    uint16 PAD;                /* 0x52c */
    uint16 PAD;                /* 0x52e */
    uint16 PAD;                /* 0x530 */
    uint16 PAD;                /* 0x532 */
    uint16 PAD;                /* 0x534 */
    uint16 PAD;                /* 0x536 */
    uint16 PAD;                /* 0x538 */
    uint16 PAD;                /* 0x53a */
    uint16 PAD;                /* 0x53c */
    uint16 PAD;                /* 0x53e */
    uint16 PAD;                /* 0x540 */
    uint16 PAD;                /* 0x542 */
    uint16 PAD;                /* 0x544 */
    uint16 PAD;                /* 0x546 */
    uint16 PAD;                /* 0x548 */
    uint16 PAD;                /* 0x54a */
    uint16 PAD;                /* 0x54c */
    uint16 PAD;                /* 0x54e */
    uint16 PAD;                /* 0x550 */
    uint16 PAD;                /* 0x552 */
    uint16 PAD;                /* 0x554 */
    uint16 PAD;                /* 0x556 */
    uint16 PAD;                /* 0x558 */
    uint16 PAD;                /* 0x55a */
    uint16 PAD;                /* 0x55c */
    uint16 PAD;                /* 0x55e */
    uint16 PAD;                /* 0x560 */
    uint16 PAD;                /* 0x562 */
    uint16 PAD;                /* 0x564 */
    uint16 PAD;                /* 0x566 */
    uint16 PAD;                /* 0x568 */
    uint16 PAD;                /* 0x56a */
    uint16 PAD;                /* 0x56c */
    uint16 PAD;                /* 0x56e */
    uint16 PAD;                /* 0x570 */
    uint16 PAD;                /* 0x572 */
    uint16 PAD;                /* 0x574 */
    uint16 PAD;                /* 0x576 */
    uint16 PAD;                /* 0x578 */
    uint16 PAD;                /* 0x57a */
    uint16 PAD;                /* 0x57c */
    uint16 PAD;                /* 0x57e */
    uint16 PAD;                /* 0x580 */
    uint16 PAD;                /* 0x582 */
    uint16 PAD;                /* 0x584 */
    uint16 PAD;                /* 0x586 */
    uint16 PAD;                /* 0x588 */
    uint16 PAD;                /* 0x58a */
    uint16 PAD;                /* 0x58c */
    uint16 PAD;                /* 0x58e */
    uint16 PAD;                /* 0x590 */
    uint16 PAD;                /* 0x592 */
    uint16 PAD;                /* 0x594 */
    uint16 PAD;                /* 0x596 */
    uint16 PAD;                /* 0x598 */
    uint16 PAD;                /* 0x59a */
    uint16 PAD;                /* 0x59c */
    uint16 PAD;                /* 0x59e */
    uint16 PAD;                /* 0x5a0 */
    uint16 PAD;                /* 0x5a2 */
    uint16 PAD;                /* 0x5a4 */
    uint16 PAD;                /* 0x5a6 */
    uint16 PAD;                /* 0x5a8 */
    uint16 PAD;                /* 0x5aa */
    uint16 PAD;                /* 0x5ac */
    uint16 PAD;                /* 0x5ae */
    uint16 PAD;                /* 0x5b0 */
    uint16 PAD;                /* 0x5b2 */
    uint16 PAD;                /* 0x5b4 */
    uint16 PAD;                /* 0x5b6 */
    uint16 PAD;                /* 0x5b8 */
    uint16 PAD;                /* 0x5ba */
    uint16 PAD;                /* 0x5bc */
    uint16 PAD;                /* 0x5be */
    uint16 PAD;                /* 0x5c0 */
    uint16 PAD;                /* 0x5c2 */
    uint16 PAD;                /* 0x5c4 */
    uint16 PAD;                /* 0x5c6 */
    uint16 PAD;                /* 0x5c8 */
    uint16 PAD;                /* 0x5ca */
    uint16 PAD;                /* 0x5cc */
    uint16 PAD;                /* 0x5ce */
    uint16 PAD;                /* 0x5d0 */
    uint16 PAD;                /* 0x5d2 */
    uint16 PAD;                /* 0x5d4 */
    uint16 PAD;                /* 0x5d6 */
    uint16 PAD;                /* 0x5d8 */
    uint16 PAD;                /* 0x5da */
    uint16 PAD;                /* 0x5dc */
    uint16 PAD;                /* 0x5de */
    uint16 PAD;                /* 0x5e0 */
    uint16 PAD;                /* 0x5e2 */
    uint16 PAD;                /* 0x5e4 */
    uint16 PAD;                /* 0x5e6 */
    uint16 PAD;                /* 0x5e8 */
    uint16 PAD;                /* 0x5ea */
    uint16 PAD;                /* 0x5ec */
    uint16 PAD;                /* 0x5ee */
    uint16 PAD;                /* 0x5f0 */
    uint16 PAD;                /* 0x5f2 */
    uint16 PAD;                /* 0x5f4 */
    uint16 PAD;                /* 0x5f6 */
    uint16 PAD;                /* 0x5f8 */
    uint16 PAD;                /* 0x5fa */
    uint16 PAD;                /* 0x5fc */
    uint16 PAD;                /* 0x5fe */
    uint16 PAD;                /* 0x600 */
    uint16 PAD;                /* 0x602 */
    uint16 PAD;                /* 0x604 */
    uint16 PAD;                /* 0x606 */
    uint16 PAD;                /* 0x608 */
    uint16 PAD;                /* 0x60a */
    uint16 PAD;                /* 0x60c */
    uint16 PAD;                /* 0x60e */
    uint16 PAD;                /* 0x610 */
    uint16 PAD;                /* 0x612 */
    uint16 PAD;                /* 0x614 */
    uint16 PAD;                /* 0x616 */
    uint16 PAD;                /* 0x618 */
    uint16 PAD;                /* 0x61a */
    uint16 PAD;                /* 0x61c */
    uint16 PAD;                /* 0x61e */
    uint16 PAD;                /* 0x620 */
    uint16 PAD;                /* 0x622 */
    uint16 PAD;                /* 0x624 */
    uint16 PAD;                /* 0x626 */
    uint16 PAD;                /* 0x628 */
    uint16 PAD;                /* 0x62a */
    uint16 PAD;                /* 0x62c */
    uint16 PAD;                /* 0x62e */
    uint16 PAD;                /* 0x630 */
    uint16 PAD;                /* 0x632 */
    uint16 PAD;                /* 0x634 */
    uint16 PAD;                /* 0x636 */
    uint16 PAD;                /* 0x638 */
    uint16 PAD;                /* 0x63a */
    uint16 PAD;                /* 0x63c */
    uint16 PAD;                /* 0x63e */
    uint16 PAD;                /* 0x640 */
    uint16 PAD;                /* 0x642 */
    uint16 PAD;                /* 0x644 */
    uint16 PAD;                /* 0x646 */
    uint16 PAD;                /* 0x648 */
    uint16 PAD;                /* 0x64a */
    uint16 PAD;                /* 0x64c */
    uint16 PAD;                /* 0x64e */
    uint16 PAD;                /* 0x650 */
    uint16 PAD;                /* 0x652 */
    uint16 PAD;                /* 0x654 */
    uint16 PAD;                /* 0x656 */
    uint16 PAD;                /* 0x658 */
    uint16 PAD;                /* 0x65a */
    uint16 PAD;                /* 0x65c */
    uint16 PAD;                /* 0x65e */
    uint16 PAD;                /* 0x660 */
    uint16 PAD;                /* 0x662 */
    uint16 PAD;                /* 0x664 */
    uint16 PAD;                /* 0x666 */
    uint16 PAD;                /* 0x668 */
    uint16 PAD;                /* 0x66a */
    uint16 PAD;                /* 0x66c */
    uint16 PAD;                /* 0x66e */
    uint16 PAD;                /* 0x670 */
    uint16 PAD;                /* 0x672 */
    uint16 PAD;                /* 0x674 */
    uint16 PAD;                /* 0x676 */
    uint16 PAD;                /* 0x678 */
    uint16 PAD;                /* 0x67a */
    uint16 PAD;                /* 0x67c */
    uint16 PAD;                /* 0x67e */
    uint16 PAD;                /* 0x680 */
    uint16 PAD;                /* 0x682 */
    uint16 PAD;                /* 0x684 */
    uint16 PAD;                /* 0x686 */
    uint16 PAD;                /* 0x688 */
    uint16 PAD;                /* 0x68a */
    uint16 PAD;                /* 0x68c */
    uint16 PAD;                /* 0x68e */
    uint16 PAD;                /* 0x690 */
    uint16 PAD;                /* 0x692 */
    uint16 PAD;                /* 0x694 */
    uint16 PAD;                /* 0x696 */
    uint16 PAD;                /* 0x698 */
    uint16 PAD;                /* 0x69a */
    uint16 PAD;                /* 0x69c */
    uint16 PAD;                /* 0x69e */
    uint16 PAD;                /* 0x6a0 */
    uint16 PAD;                /* 0x6a2 */
    uint16 PAD;                /* 0x6a4 */
    uint16 PAD;                /* 0x6a6 */
    uint16 PAD;                /* 0x6a8 */
    uint16 PAD;                /* 0x6aa */
    uint16 PAD;                /* 0x6ac */
    uint16 PAD;                /* 0x6ae */
    uint16 PAD;                /* 0x6b0 */
    uint16 PAD;                /* 0x6b2 */
    uint16 PAD;                /* 0x6b4 */
    uint16 PAD;                /* 0x6b6 */
    uint16 PAD;                /* 0x6b8 */
    uint16 PAD;                /* 0x6ba */
    uint16 PAD;                /* 0x6bc */
    uint16 PAD;                /* 0x6be */
    uint16 PAD;                /* 0x6c0 */
    uint16 PAD;                /* 0x6c2 */
    uint16 PAD;                /* 0x6c4 */
    uint16 PAD;                /* 0x6c6 */
    uint16 PAD;                /* 0x6c8 */
    uint16 PAD;                /* 0x6ca */
    uint16 PAD;                /* 0x6cc */
    uint16 PAD;                /* 0x6ce */
    uint16 PAD;                /* 0x6d0 */
    uint16 PAD;                /* 0x6d2 */
    uint16 PAD;                /* 0x6d4 */
    uint16 PAD;                /* 0x6d6 */
    uint16 PAD;                /* 0x6d8 */
    uint16 PAD;                /* 0x6da */
    uint16 PAD;                /* 0x6dc */
    uint16 PAD;                /* 0x6de */
    uint16 PAD;                /* 0x6e0 */
    uint16 PAD;                /* 0x6e2 */
    uint16 PAD;                /* 0x6e4 */
    uint16 PAD;                /* 0x6e6 */
    uint16 PAD;                /* 0x6e8 */
    uint16 PAD;                /* 0x6ea */
    uint16 PAD;                /* 0x6ec */
    uint16 PAD;                /* 0x6ee */
    uint16 PAD;                /* 0x6f0 */
    uint16 PAD;                /* 0x6f2 */
    uint16 PAD;                /* 0x6f4 */
    uint16 PAD;                /* 0x6f6 */
    uint16 PAD;                /* 0x6f8 */
    uint16 PAD;                /* 0x6fa */
    uint16 PAD;                /* 0x6fc */
    uint16 PAD;                /* 0x6fe */
    uint16 PAD;                /* 0x700 */
    uint16 PAD;                /* 0x702 */
    uint16 PAD;                /* 0x704 */
    uint16 PAD;                /* 0x706 */
    uint16 PAD;                /* 0x708 */
    uint16 PAD;                /* 0x70a */
    uint16 PAD;                /* 0x70c */
    uint16 PAD;                /* 0x70e */
    uint16 PAD;                /* 0x710 */
    uint16 PAD;                /* 0x712 */
    uint16 PAD;                /* 0x714 */
    uint16 PAD;                /* 0x716 */
    uint16 PAD;                /* 0x718 */
    uint16 PAD;                /* 0x71a */
    uint16 PAD;                /* 0x71c */
    uint16 PAD;                /* 0x71e */
    uint16 PAD;                /* 0x720 */
    uint16 PAD;                /* 0x722 */
    uint16 PAD;                /* 0x724 */
    uint16 PAD;                /* 0x726 */
    uint16 PAD;                /* 0x728 */
    uint16 PAD;                /* 0x72a */
    uint16 PAD;                /* 0x72c */
    uint16 PAD;                /* 0x72e */
    uint16 PAD;                /* 0x730 */
    uint16 PAD;                /* 0x732 */
    uint16 PAD;                /* 0x734 */
    uint16 PAD;                /* 0x736 */
    uint16 PAD;                /* 0x738 */
    uint16 PAD;                /* 0x73a */
    uint16 PAD;                /* 0x73c */
    uint16 PAD;                /* 0x73e */
    uint16 PAD;                /* 0x740 */
    uint16 PAD;                /* 0x742 */
    uint16 PAD;                /* 0x744 */
    uint16 PAD;                /* 0x746 */
    uint16 PAD;                /* 0x748 */
    uint16 PAD;                /* 0x74a */
    uint16 PAD;                /* 0x74c */
    uint16 PAD;                /* 0x74e */
    uint16 PAD;                /* 0x750 */
    uint16 PAD;                /* 0x752 */
    uint16 PAD;                /* 0x754 */
    uint16 PAD;                /* 0x756 */
    uint16 PAD;                /* 0x758 */
    uint16 PAD;                /* 0x75a */
    uint16 PAD;                /* 0x75c */
    uint16 PAD;                /* 0x75e */
    uint16 PAD;                /* 0x760 */
    uint16 PAD;                /* 0x762 */
    uint16 PAD;                /* 0x764 */
    uint16 PAD;                /* 0x766 */
    uint16 PAD;                /* 0x768 */
    uint16 PAD;                /* 0x76a */
    uint16 PAD;                /* 0x76c */
    uint16 PAD;                /* 0x76e */
    uint16 PAD;                /* 0x770 */
    uint16 PAD;                /* 0x772 */
    uint16 PAD;                /* 0x774 */
    uint16 PAD;                /* 0x776 */
    uint16 PAD;                /* 0x778 */
    uint16 PAD;                /* 0x77a */
    uint16 PAD;                /* 0x77c */
    uint16 PAD;                /* 0x77e */
    uint16 PAD;                /* 0x780 */
    uint16 PAD;                /* 0x782 */
    uint16 PAD;                /* 0x784 */
    uint16 PAD;                /* 0x786 */
    uint16 PAD;                /* 0x788 */
    uint16 PAD;                /* 0x78a */
    uint16 PAD;                /* 0x78c */
    uint16 PAD;                /* 0x78e */
    uint16 PAD;                /* 0x790 */
    uint16 PAD;                /* 0x792 */
    uint16 PAD;                /* 0x794 */
    uint16 PAD;                /* 0x796 */
    uint16 PAD;                /* 0x798 */
    uint16 PAD;                /* 0x79a */
    uint16 PAD;                /* 0x79c */
    uint16 PAD;                /* 0x79e */
    uint16 PAD;                /* 0x7a0 */
    uint16 PAD;                /* 0x7a2 */
    uint16 PAD;                /* 0x7a4 */
    uint16 PAD;                /* 0x7a6 */
    uint16 PAD;                /* 0x7a8 */
    uint16 PAD;                /* 0x7aa */
    uint16 PAD;                /* 0x7ac */
    uint16 PAD;                /* 0x7ae */
    uint16 PAD;                /* 0x7b0 */
    uint16 PAD;                /* 0x7b2 */
    uint16 PAD;                /* 0x7b4 */
    uint16 PAD;                /* 0x7b6 */
    uint16 PAD;                /* 0x7b8 */
    uint16 PAD;                /* 0x7ba */
    uint16 PAD;                /* 0x7bc */
    uint16 PAD;                /* 0x7be */
    uint16 PAD;                /* 0x7c0 */
    uint16 PAD;                /* 0x7c2 */
    uint16 PAD;                /* 0x7c4 */
    uint16 PAD;                /* 0x7c6 */
    uint16 PAD;                /* 0x7c8 */
    uint16 PAD;                /* 0x7ca */
    uint16 PAD;                /* 0x7cc */
    uint16 PAD;                /* 0x7ce */
    uint16 PAD;                /* 0x7d0 */
    uint16 PAD;                /* 0x7d2 */
    uint16 PAD;                /* 0x7d4 */
    uint16 PAD;                /* 0x7d6 */
    uint16 PAD;                /* 0x7d8 */
    uint16 PAD;                /* 0x7da */
    uint16 PAD;                /* 0x7dc */
    uint16 PAD;                /* 0x7de */
    uint16 PAD;                /* 0x7e0 */
    uint16 PAD;                /* 0x7e2 */
    uint16 PAD;                /* 0x7e4 */
    uint16 PAD;                /* 0x7e6 */
    uint16 PAD;                /* 0x7e8 */
    uint16 PAD;                /* 0x7ea */
    uint16 PAD;                /* 0x7ec */
    uint16 PAD;                /* 0x7ee */
    uint16 PAD;                /* 0x7f0 */
    uint16 PAD;                /* 0x7f2 */
    uint16 PAD;                /* 0x7f4 */
    uint16 PAD;                /* 0x7f6 */
    uint16 PAD;                /* 0x7f8 */
    uint16 PAD;                /* 0x7fa */
    uint16 PAD;                /* 0x7fc */
    uint16 PAD;                /* 0x7fe */
    uint16 PAD;                /* 0x800 */
    uint16 PAD;                /* 0x802 */
    uint16 PAD;                /* 0x804 */
    uint16 PAD;                /* 0x806 */
    uint16 PAD;                /* 0x808 */
    uint16 PAD;                /* 0x80a */
    uint16 PAD;                /* 0x80c */
    uint16 PAD;                /* 0x80e */
    uint16 PAD;                /* 0x810 */
    uint16 PAD;                /* 0x812 */
    uint16 PAD;                /* 0x814 */
    uint16 PAD;                /* 0x816 */
    uint16 PAD;                /* 0x818 */
    uint16 PAD;                /* 0x81a */
    uint16 PAD;                /* 0x81c */
    uint16 PAD;                /* 0x81e */
    uint16 PAD;                /* 0x820 */
    uint16 PAD;                /* 0x822 */
    uint16 PAD;                /* 0x824 */
    uint16 PAD;                /* 0x826 */
    uint16 PAD;                /* 0x828 */
    uint16 PAD;                /* 0x82a */
    uint16 PAD;                /* 0x82c */
    uint16 PAD;                /* 0x82e */
    uint16 PAD;                /* 0x830 */
    uint16 PAD;                /* 0x832 */
    uint16 PAD;                /* 0x834 */
    uint16 PAD;                /* 0x836 */
    uint16 PAD;                /* 0x838 */
    uint16 PAD;                /* 0x83a */
    uint16 PAD;                /* 0x83c */
    uint16 PAD;                /* 0x83e */
    uint16 PAD;                /* 0x840 */
    uint16 PAD;                /* 0x842 */
    uint16 PAD;                /* 0x844 */
    uint16 PAD;                /* 0x846 */
    uint16 PAD;                /* 0x848 */
    uint16 PAD;                /* 0x84a */
    uint16 PAD;                /* 0x84c */
    uint16 PAD;                /* 0x84e */
    uint16 PAD;                /* 0x850 */
    uint16 PAD;                /* 0x852 */
    uint16 PAD;                /* 0x854 */
    uint16 PAD;                /* 0x856 */
    uint16 PAD;                /* 0x858 */
    uint16 PAD;                /* 0x85a */
    uint16 PAD;                /* 0x85c */
    uint16 PAD;                /* 0x85e */
    uint16 PAD;                /* 0x860 */
    uint16 PAD;                /* 0x862 */
    uint16 PAD;                /* 0x864 */
    uint16 PAD;                /* 0x866 */
    uint16 PAD;                /* 0x868 */
    uint16 PAD;                /* 0x86a */
    uint16 PAD;                /* 0x86c */
    uint16 PAD;                /* 0x86e */
    uint16 PAD;                /* 0x870 */
    uint16 PAD;                /* 0x872 */
    uint16 PAD;                /* 0x874 */
    uint16 PAD;                /* 0x876 */
    uint16 PAD;                /* 0x878 */
    uint16 PAD;                /* 0x87a */
    uint16 PAD;                /* 0x87c */
    uint16 PAD;                /* 0x87e */
    uint16 PAD;                /* 0x880 */
    uint16 PAD;                /* 0x882 */
    uint16 PAD;                /* 0x884 */
    uint16 PAD;                /* 0x886 */
    uint16 PAD;                /* 0x888 */
    uint16 PAD;                /* 0x88a */
    uint16 PAD;                /* 0x88c */
    uint16 PAD;                /* 0x88e */
    uint16 PAD;                /* 0x890 */
    uint16 PAD;                /* 0x892 */
    uint16 PAD;                /* 0x894 */
    uint16 PAD;                /* 0x896 */
    uint16 PAD;                /* 0x898 */
    uint16 PAD;                /* 0x89a */
    uint16 PAD;                /* 0x89c */
    uint16 PAD;                /* 0x89e */
    uint16 PAD;                /* 0x8a0 */
    uint16 PAD;                /* 0x8a2 */
    uint16 PAD;                /* 0x8a4 */
    uint16 PAD;                /* 0x8a6 */
    uint16 PAD;                /* 0x8a8 */
    uint16 PAD;                /* 0x8aa */
    uint16 PAD;                /* 0x8ac */
    uint16 PAD;                /* 0x8ae */
    uint16 PAD;                /* 0x8b0 */
    uint16 PAD;                /* 0x8b2 */
    uint16 PAD;                /* 0x8b4 */
    uint16 PAD;                /* 0x8b6 */
    uint16 PAD;                /* 0x8b8 */
    uint16 PAD;                /* 0x8ba */
    uint16 PAD;                /* 0x8bc */
    uint16 PAD;                /* 0x8be */
    uint16 PAD;                /* 0x8c0 */
    uint16 PAD;                /* 0x8c2 */
    uint16 PAD;                /* 0x8c4 */
    uint16 PAD;                /* 0x8c6 */
    uint16 PAD;                /* 0x8c8 */
    uint16 PAD;                /* 0x8ca */
    uint16 PAD;                /* 0x8cc */
    uint16 PAD;                /* 0x8ce */
    uint16 PAD;                /* 0x8d0 */
    uint16 PAD;                /* 0x8d2 */
    uint16 PAD;                /* 0x8d4 */
    uint16 PAD;                /* 0x8d6 */
    uint16 PAD;                /* 0x8d8 */
    uint16 PAD;                /* 0x8da */
    uint16 PAD;                /* 0x8dc */
    uint16 PAD;                /* 0x8de */
    uint16 PAD;                /* 0x8e0 */
    uint16 PAD;                /* 0x8e2 */
    uint16 PAD;                /* 0x8e4 */
    uint16 PAD;                /* 0x8e6 */
    uint16 PAD;                /* 0x8e8 */
    uint16 PAD;                /* 0x8ea */
    uint16 PAD;                /* 0x8ec */
    uint16 PAD;                /* 0x8ee */
    uint16 PAD;                /* 0x8f0 */
    uint16 PAD;                /* 0x8f2 */
    uint16 PAD;                /* 0x8f4 */
    uint16 PAD;                /* 0x8f6 */
    uint16 PAD;                /* 0x8f8 */
    uint16 PAD;                /* 0x8fa */
    uint16 PAD;                /* 0x8fc */
    uint16 PAD;                /* 0x8fe */
    uint16 PAD;                /* 0x900 */
    uint16 PAD;                /* 0x902 */
    uint16 PAD;                /* 0x904 */
    uint16 PAD;                /* 0x906 */
    uint16 PAD;                /* 0x908 */
    uint16 PAD;                /* 0x90a */
    uint16 PAD;                /* 0x90c */
    uint16 PAD;                /* 0x90e */
    uint16 PAD;                /* 0x910 */
    uint16 PAD;                /* 0x912 */
    uint16 PAD;                /* 0x914 */
    uint16 PAD;                /* 0x916 */
    uint16 PAD;                /* 0x918 */
    uint16 PAD;                /* 0x91a */
    uint16 PAD;                /* 0x91c */
    uint16 PAD;                /* 0x91e */
    uint16 PAD;                /* 0x920 */
    uint16 PAD;                /* 0x922 */
    uint16 PAD;                /* 0x924 */
    uint16 PAD;                /* 0x926 */
    uint16 PAD;                /* 0x928 */
    uint16 PAD;                /* 0x92a */
    uint16 PAD;                /* 0x92c */
    uint16 PAD;                /* 0x92e */
    uint16 PAD;                /* 0x930 */
    uint16 PAD;                /* 0x932 */
    uint16 PAD;                /* 0x934 */
    uint16 PAD;                /* 0x936 */
    uint16 PAD;                /* 0x938 */
    uint16 PAD;                /* 0x93a */
    uint16 PAD;                /* 0x93c */
    uint16 PAD;                /* 0x93e */
    uint16 PAD;                /* 0x940 */
    uint16 PAD;                /* 0x942 */
    uint16 PAD;                /* 0x944 */
    uint16 PAD;                /* 0x946 */
    uint16 PAD;                /* 0x948 */
    uint16 PAD;                /* 0x94a */
    uint16 PAD;                /* 0x94c */
    uint16 PAD;                /* 0x94e */
    uint16 PAD;                /* 0x950 */
    uint16 PAD;                /* 0x952 */
    uint16 PAD;                /* 0x954 */
    uint16 PAD;                /* 0x956 */
    uint16 PAD;                /* 0x958 */
    uint16 PAD;                /* 0x95a */
    uint16 PAD;                /* 0x95c */
    uint16 PAD;                /* 0x95e */
    uint16 PAD;                /* 0x960 */
    uint16 PAD;                /* 0x962 */
    uint16 PAD;                /* 0x964 */
    uint16 PAD;                /* 0x966 */
    uint16 PAD;                /* 0x968 */
    uint16 PAD;                /* 0x96a */
    uint16 PAD;                /* 0x96c */
    uint16 PAD;                /* 0x96e */
    uint16 PAD;                /* 0x970 */
    uint16 PAD;                /* 0x972 */
    uint16 PAD;                /* 0x974 */
    uint16 PAD;                /* 0x976 */
    uint16 PAD;                /* 0x978 */
    uint16 PAD;                /* 0x97a */
    uint16 PAD;                /* 0x97c */
    uint16 PAD;                /* 0x97e */
    uint16 PAD;                /* 0x980 */
    uint16 PAD;                /* 0x982 */
    uint16 PAD;                /* 0x984 */
    uint16 PAD;                /* 0x986 */
    uint16 PAD;                /* 0x988 */
    uint16 PAD;                /* 0x98a */
    uint16 PAD;                /* 0x98c */
    uint16 PAD;                /* 0x98e */
    uint16 PAD;                /* 0x990 */
    uint16 PAD;                /* 0x992 */
    uint16 PAD;                /* 0x994 */
    uint16 PAD;                /* 0x996 */
    uint16 PAD;                /* 0x998 */
    uint16 PAD;                /* 0x99a */
    uint16 PAD;                /* 0x99c */
    uint16 PAD;                /* 0x99e */
    uint16 PAD;                /* 0x9a0 */
    uint16 PAD;                /* 0x9a2 */
    uint16 PAD;                /* 0x9a4 */
    uint16 PAD;                /* 0x9a6 */
    uint16 PAD;                /* 0x9a8 */
    uint16 PAD;                /* 0x9aa */
    uint16 PAD;                /* 0x9ac */
    uint16 PAD;                /* 0x9ae */
    uint16 PAD;                /* 0x9b0 */
    uint16 PAD;                /* 0x9b2 */
    uint16 PAD;                /* 0x9b4 */
    uint16 PAD;                /* 0x9b6 */
    uint16 PAD;                /* 0x9b8 */
    uint16 PAD;                /* 0x9ba */
    uint16 PAD;                /* 0x9bc */
    uint16 PAD;                /* 0x9be */
    uint16 PAD;                /* 0x9c0 */
    uint16 PAD;                /* 0x9c2 */
    uint16 PAD;                /* 0x9c4 */
    uint16 PAD;                /* 0x9c6 */
    uint16 PAD;                /* 0x9c8 */
    uint16 PAD;                /* 0x9ca */
    uint16 PAD;                /* 0x9cc */
    uint16 PAD;                /* 0x9ce */
    uint16 PAD;                /* 0x9d0 */
    uint16 PAD;                /* 0x9d2 */
    uint16 PAD;                /* 0x9d4 */
    uint16 PAD;                /* 0x9d6 */
    uint16 PAD;                /* 0x9d8 */
    uint16 PAD;                /* 0x9da */
    uint16 PAD;                /* 0x9dc */
    uint16 PAD;                /* 0x9de */
    uint16 PAD;                /* 0x9e0 */
    uint16 PAD;                /* 0x9e2 */
    uint16 PAD;                /* 0x9e4 */
    uint16 PAD;                /* 0x9e6 */
    uint16 PAD;                /* 0x9e8 */
    uint16 PAD;                /* 0x9ea */
    uint16 PAD;                /* 0x9ec */
    uint16 PAD;                /* 0x9ee */
    uint16 PAD;                /* 0x9f0 */
    uint16 PAD;                /* 0x9f2 */
    uint16 PAD;                /* 0x9f4 */
    uint16 PAD;                /* 0x9f6 */
    uint16 PAD;                /* 0x9f8 */
    uint16 PAD;                /* 0x9fa */
    uint16 PAD;                /* 0x9fc */
    uint16 PAD;                /* 0x9fe */
    uint16 PAD;                /* 0xa00 */
    uint16 PAD;                /* 0xa02 */
    uint16 PAD;                /* 0xa04 */
    uint16 PAD;                /* 0xa06 */
    uint16 PAD;                /* 0xa08 */
    uint16 PAD;                /* 0xa0a */
    uint16 PAD;                /* 0xa0c */
    uint16 PAD;                /* 0xa0e */
    uint16 PAD;                /* 0xa10 */
    uint16 PAD;                /* 0xa12 */
    uint16 PAD;                /* 0xa14 */
    uint16 PAD;                /* 0xa16 */
    uint16 PAD;                /* 0xa18 */
    uint16 PAD;                /* 0xa1a */
    uint16 PAD;                /* 0xa1c */
    uint16 PAD;                /* 0xa1e */
    uint16 PAD;                /* 0xa20 */
    uint16 PAD;                /* 0xa22 */
    uint16 PAD;                /* 0xa24 */
    uint16 PAD;                /* 0xa26 */
    uint16 PAD;                /* 0xa28 */
    uint16 PAD;                /* 0xa2a */
    uint16 PAD;                /* 0xa2c */
    uint16 PAD;                /* 0xa2e */
    uint16 PAD;                /* 0xa30 */
    uint16 PAD;                /* 0xa32 */
    uint16 PAD;                /* 0xa34 */
    uint16 PAD;                /* 0xa36 */
    uint16 PAD;                /* 0xa38 */
    uint16 PAD;                /* 0xa3a */
    uint16 PAD;                /* 0xa3c */
    uint16 PAD;                /* 0xa3e */
    uint16 PAD;                /* 0xa40 */
    uint16 PAD;                /* 0xa42 */
    uint16 PAD;                /* 0xa44 */
    uint16 PAD;                /* 0xa46 */
    uint16 PAD;                /* 0xa48 */
    uint16 PAD;                /* 0xa4a */
    uint16 PAD;                /* 0xa4c */
    uint16 PAD;                /* 0xa4e */
    uint16 PAD;                /* 0xa50 */
    uint16 PAD;                /* 0xa52 */
    uint16 PAD;                /* 0xa54 */
    uint16 PAD;                /* 0xa56 */
    uint16 PAD;                /* 0xa58 */
    uint16 PAD;                /* 0xa5a */
    uint16 PAD;                /* 0xa5c */
    uint16 PAD;                /* 0xa5e */
    uint16 PAD;                /* 0xa60 */
    uint16 PAD;                /* 0xa62 */
    uint16 PAD;                /* 0xa64 */
    uint16 PAD;                /* 0xa66 */
    uint16 PAD;                /* 0xa68 */
    uint16 PAD;                /* 0xa6a */
    uint16 PAD;                /* 0xa6c */
    uint16 PAD;                /* 0xa6e */
    uint16 PAD;                /* 0xa70 */
    uint16 PAD;                /* 0xa72 */
    uint16 PAD;                /* 0xa74 */
    uint16 PAD;                /* 0xa76 */
    uint16 PAD;                /* 0xa78 */
    uint16 PAD;                /* 0xa7a */
    uint16 PAD;                /* 0xa7c */
    uint16 PAD;                /* 0xa7e */
    uint16 PAD;                /* 0xa80 */
    uint16 PAD;                /* 0xa82 */
    uint16 PAD;                /* 0xa84 */
    uint16 PAD;                /* 0xa86 */
    uint16 PAD;                /* 0xa88 */
    uint16 PAD;                /* 0xa8a */
    uint16 PAD;                /* 0xa8c */
    uint16 PAD;                /* 0xa8e */
    uint16 PAD;                /* 0xa90 */
    uint16 PAD;                /* 0xa92 */
    uint16 PAD;                /* 0xa94 */
    uint16 PAD;                /* 0xa96 */
    uint16 PAD;                /* 0xa98 */
    uint16 PAD;                /* 0xa9a */
    uint16 PAD;                /* 0xa9c */
    uint16 PAD;                /* 0xa9e */
    uint16 PAD;                /* 0xaa0 */
    uint16 PAD;                /* 0xaa2 */
    uint16 PAD;                /* 0xaa4 */
    uint16 PAD;                /* 0xaa6 */
    uint16 PAD;                /* 0xaa8 */
    uint16 PAD;                /* 0xaaa */
    uint16 PAD;                /* 0xaac */
    uint16 PAD;                /* 0xaae */
    uint16 PAD;                /* 0xab0 */
    uint16 PAD;                /* 0xab2 */
    uint16 PAD;                /* 0xab4 */
    uint16 PAD;                /* 0xab6 */
    uint16 PAD;                /* 0xab8 */
    uint16 PAD;                /* 0xaba */
    uint16 PAD;                /* 0xabc */
    uint16 PAD;                /* 0xabe */
    uint16 PAD;                /* 0xac0 */
    uint16 PAD;                /* 0xac2 */
    uint16 PAD;                /* 0xac4 */
    uint16 PAD;                /* 0xac6 */
    uint16 PAD;                /* 0xac8 */
    uint16 PAD;                /* 0xaca */
    uint16 PAD;                /* 0xacc */
    uint16 PAD;                /* 0xace */
    uint16 PAD;                /* 0xad0 */
    uint16 PAD;                /* 0xad2 */
    uint16 PAD;                /* 0xad4 */
    uint16 PAD;                /* 0xad6 */
    uint16 PAD;                /* 0xad8 */
    uint16 PAD;                /* 0xada */
    uint16 PAD;                /* 0xadc */
    uint16 PAD;                /* 0xade */
    uint16 PAD;                /* 0xae0 */
    uint16 PAD;                /* 0xae2 */
    uint16 PAD;                /* 0xae4 */
    uint16 PAD;                /* 0xae6 */
    uint16 PAD;                /* 0xae8 */
    uint16 PAD;                /* 0xaea */
    uint16 PAD;                /* 0xaec */
    uint16 PAD;                /* 0xaee */
    uint16 PAD;                /* 0xaf0 */
    uint16 PAD;                /* 0xaf2 */
    uint16 PAD;                /* 0xaf4 */
    uint16 PAD;                /* 0xaf6 */
    uint16 PAD;                /* 0xaf8 */
    uint16 PAD;                /* 0xafa */
    uint16 PAD;                /* 0xafc */
    uint16 PAD;                /* 0xafe */
    uint16 PAD;                /* 0xb00 */
    uint16 PAD;                /* 0xb02 */
    uint16 PAD;                /* 0xb04 */
    uint16 PAD;                /* 0xb06 */
    uint16 PAD;                /* 0xb08 */
    uint16 PAD;                /* 0xb0a */
    uint16 PAD;                /* 0xb0c */
    uint16 PAD;                /* 0xb0e */
    uint16 PAD;                /* 0xb10 */
    uint16 PAD;                /* 0xb12 */
    uint16 PAD;                /* 0xb14 */
    uint16 PAD;                /* 0xb16 */
    uint16 PAD;                /* 0xb18 */
    uint16 PAD;                /* 0xb1a */
    uint16 PAD;                /* 0xb1c */
    uint16 PAD;                /* 0xb1e */
    uint16 PAD;                /* 0xb20 */
    uint16 PAD;                /* 0xb22 */
    uint16 PAD;                /* 0xb24 */
    uint16 PAD;                /* 0xb26 */
    uint16 PAD;                /* 0xb28 */
    uint16 PAD;                /* 0xb2a */
    uint16 PAD;                /* 0xb2c */
    uint16 PAD;                /* 0xb2e */
    uint16 PAD;                /* 0xb30 */
    uint16 PAD;                /* 0xb32 */
    uint16 PAD;                /* 0xb34 */
    uint16 PAD;                /* 0xb36 */
    uint16 PAD;                /* 0xb38 */
    uint16 PAD;                /* 0xb3a */
    uint16 PAD;                /* 0xb3c */
    uint16 PAD;                /* 0xb3e */
    uint16 PAD;                /* 0xb40 */
    uint16 PAD;                /* 0xb42 */
    uint16 PAD;                /* 0xb44 */
    uint16 PAD;                /* 0xb46 */
    uint16 PAD;                /* 0xb48 */
    uint16 PAD;                /* 0xb4a */
    uint16 PAD;                /* 0xb4c */
    uint16 PAD;                /* 0xb4e */
    uint16 PAD;                /* 0xb50 */
    uint16 PAD;                /* 0xb52 */
    uint16 PAD;                /* 0xb54 */
    uint16 PAD;                /* 0xb56 */
    uint16 PAD;                /* 0xb58 */
    uint16 PAD;                /* 0xb5a */
    uint16 PAD;                /* 0xb5c */
    uint16 PAD;                /* 0xb5e */
    uint16 PAD;                /* 0xb60 */
    uint16 PAD;                /* 0xb62 */
    uint16 PAD;                /* 0xb64 */
    uint16 PAD;                /* 0xb66 */
    uint16 PAD;                /* 0xb68 */
    uint16 PAD;                /* 0xb6a */
    uint16 PAD;                /* 0xb6c */
    uint16 PAD;                /* 0xb6e */
    uint16 PAD;                /* 0xb70 */
    uint16 PAD;                /* 0xb72 */
    uint16 PAD;                /* 0xb74 */
    uint16 PAD;                /* 0xb76 */
    uint16 PAD;                /* 0xb78 */
    uint16 PAD;                /* 0xb7a */
    uint16 PAD;                /* 0xb7c */
    uint16 PAD;                /* 0xb7e */
    uint16 PAD;                /* 0xb80 */
    uint16 PAD;                /* 0xb82 */
    uint16 PAD;                /* 0xb84 */
    uint16 PAD;                /* 0xb86 */
    uint16 PAD;                /* 0xb88 */
    uint16 PAD;                /* 0xb8a */
    uint16 PAD;                /* 0xb8c */
    uint16 PAD;                /* 0xb8e */
    uint16 PAD;                /* 0xb90 */
    uint16 PAD;                /* 0xb92 */
    uint16 PAD;                /* 0xb94 */
    uint16 PAD;                /* 0xb96 */
    uint16 PAD;                /* 0xb98 */
    uint16 PAD;                /* 0xb9a */
    uint16 PAD;                /* 0xb9c */
    uint16 PAD;                /* 0xb9e */
    uint16 PAD;                /* 0xba0 */
    uint16 PAD;                /* 0xba2 */
    uint16 PAD;                /* 0xba4 */
    uint16 PAD;                /* 0xba6 */
    uint16 PAD;                /* 0xba8 */
    uint16 PAD;                /* 0xbaa */
    uint16 PAD;                /* 0xbac */
    uint16 PAD;                /* 0xbae */
    uint16 PAD;                /* 0xbb0 */
    uint16 PAD;                /* 0xbb2 */
    uint16 PAD;                /* 0xbb4 */
    uint16 PAD;                /* 0xbb6 */
    uint16 PAD;                /* 0xbb8 */
    uint16 PAD;                /* 0xbba */
    uint16 PAD;                /* 0xbbc */
    uint16 PAD;                /* 0xbbe */
    uint16 PAD;                /* 0xbc0 */
    uint16 PAD;                /* 0xbc2 */
    uint16 PAD;                /* 0xbc4 */
    uint16 PAD;                /* 0xbc6 */
    uint16 PAD;                /* 0xbc8 */
    uint16 PAD;                /* 0xbca */
    uint16 PAD;                /* 0xbcc */
    uint16 PAD;                /* 0xbce */
    uint16 PAD;                /* 0xbd0 */
    uint16 PAD;                /* 0xbd2 */
    uint16 PAD;                /* 0xbd4 */
    uint16 PAD;                /* 0xbd6 */
    uint16 PAD;                /* 0xbd8 */
    uint16 PAD;                /* 0xbda */
    uint16 PAD;                /* 0xbdc */
    uint16 PAD;                /* 0xbde */
    uint16 PAD;                /* 0xbe0 */
    uint16 PAD;                /* 0xbe2 */
    uint16 PAD;                /* 0xbe4 */
    uint16 PAD;                /* 0xbe6 */
    uint16 PAD;                /* 0xbe8 */
    uint16 PAD;                /* 0xbea */
    uint16 PAD;                /* 0xbec */
    uint16 PAD;                /* 0xbee */
    uint16 PAD;                /* 0xbf0 */
    uint16 PAD;                /* 0xbf2 */
    uint16 PAD;                /* 0xbf4 */
    uint16 PAD;                /* 0xbf6 */
    uint16 PAD;                /* 0xbf8 */
    uint16 PAD;                /* 0xbfa */
    uint16 PAD;                /* 0xbfc */
    uint16 PAD;                /* 0xbfe */
    uint16 PAD;                /* 0xc00 */
    uint16 PAD;                /* 0xc02 */
    uint16 PAD;                /* 0xc04 */
    uint16 PAD;                /* 0xc06 */
    uint16 PAD;                /* 0xc08 */
    uint16 PAD;                /* 0xc0a */
    uint16 PAD;                /* 0xc0c */
    uint16 PAD;                /* 0xc0e */
    uint16 PAD;                /* 0xc10 */
    uint16 PAD;                /* 0xc12 */
    uint16 PAD;                /* 0xc14 */
    uint16 PAD;                /* 0xc16 */
    uint16 PAD;                /* 0xc18 */
    uint16 PAD;                /* 0xc1a */
    uint16 PAD;                /* 0xc1c */
    uint16 PAD;                /* 0xc1e */
    uint16 PAD;                /* 0xc20 */
    uint16 PAD;                /* 0xc22 */
    uint16 PAD;                /* 0xc24 */
    uint16 PAD;                /* 0xc26 */
    uint16 PAD;                /* 0xc28 */
    uint16 PAD;                /* 0xc2a */
    uint16 PAD;                /* 0xc2c */
    uint16 PAD;                /* 0xc2e */
    uint16 PAD;                /* 0xc30 */
    uint16 PAD;                /* 0xc32 */
    uint16 PAD;                /* 0xc34 */
    uint16 PAD;                /* 0xc36 */
    uint16 PAD;                /* 0xc38 */
    uint16 PAD;                /* 0xc3a */
    uint16 PAD;                /* 0xc3c */
    uint16 PAD;                /* 0xc3e */
    uint16 PAD;                /* 0xc40 */
    uint16 PAD;                /* 0xc42 */
    uint16 PAD;                /* 0xc44 */
    uint16 PAD;                /* 0xc46 */
    uint16 PAD;                /* 0xc48 */
    uint16 PAD;                /* 0xc4a */
    uint16 PAD;                /* 0xc4c */
    uint16 PAD;                /* 0xc4e */
    uint16 PAD;                /* 0xc50 */
    uint16 PAD;                /* 0xc52 */
    uint16 PAD;                /* 0xc54 */
    uint16 PAD;                /* 0xc56 */
    uint16 PAD;                /* 0xc58 */
    uint16 PAD;                /* 0xc5a */
    uint16 PAD;                /* 0xc5c */
    uint16 PAD;                /* 0xc5e */
    uint16 PAD;                /* 0xc60 */
    uint16 PAD;                /* 0xc62 */
    uint16 PAD;                /* 0xc64 */
    uint16 PAD;                /* 0xc66 */
    uint16 PAD;                /* 0xc68 */
    uint16 PAD;                /* 0xc6a */
    uint16 PAD;                /* 0xc6c */
    uint16 PAD;                /* 0xc6e */
    uint16 PAD;                /* 0xc70 */
    uint16 PAD;                /* 0xc72 */
    uint16 PAD;                /* 0xc74 */
    uint16 PAD;                /* 0xc76 */
    uint16 PAD;                /* 0xc78 */
    uint16 PAD;                /* 0xc7a */
    uint16 PAD;                /* 0xc7c */
    uint16 PAD;                /* 0xc7e */
    uint16 PAD;                /* 0xc80 */
    uint16 PAD;                /* 0xc82 */
    uint16 PAD;                /* 0xc84 */
    uint16 PAD;                /* 0xc86 */
    uint16 PAD;                /* 0xc88 */
    uint16 PAD;                /* 0xc8a */
    uint16 PAD;                /* 0xc8c */
    uint16 PAD;                /* 0xc8e */
    uint16 PAD;                /* 0xc90 */
    uint16 PAD;                /* 0xc92 */
    uint16 PAD;                /* 0xc94 */
    uint16 PAD;                /* 0xc96 */
    uint16 PAD;                /* 0xc98 */
    uint16 PAD;                /* 0xc9a */
    uint16 PAD;                /* 0xc9c */
    uint16 PAD;                /* 0xc9e */
    uint16 PAD;                /* 0xca0 */
    uint16 PAD;                /* 0xca2 */
    uint16 PAD;                /* 0xca4 */
    uint16 PAD;                /* 0xca6 */
    uint16 PAD;                /* 0xca8 */
    uint16 PAD;                /* 0xcaa */
    uint16 PAD;                /* 0xcac */
    uint16 PAD;                /* 0xcae */
    uint16 PAD;                /* 0xcb0 */
    uint16 PAD;                /* 0xcb2 */
    uint16 PAD;                /* 0xcb4 */
    uint16 PAD;                /* 0xcb6 */
    uint16 PAD;                /* 0xcb8 */
    uint16 PAD;                /* 0xcba */
    uint16 PAD;                /* 0xcbc */
    uint16 PAD;                /* 0xcbe */
    uint16 PAD;                /* 0xcc0 */
    uint16 PAD;                /* 0xcc2 */
    uint16 PAD;                /* 0xcc4 */
    uint16 PAD;                /* 0xcc6 */
    uint16 PAD;                /* 0xcc8 */
    uint16 PAD;                /* 0xcca */
    uint16 PAD;                /* 0xccc */
    uint16 PAD;                /* 0xcce */
    uint16 PAD;                /* 0xcd0 */
    uint16 PAD;                /* 0xcd2 */
    uint16 PAD;                /* 0xcd4 */
    uint16 PAD;                /* 0xcd6 */
    uint16 PAD;                /* 0xcd8 */
    uint16 PAD;                /* 0xcda */
    uint16 PAD;                /* 0xcdc */
    uint16 PAD;                /* 0xcde */
    uint16 PAD;                /* 0xce0 */
    uint16 PAD;                /* 0xce2 */
    uint16 PAD;                /* 0xce4 */
    uint16 PAD;                /* 0xce6 */
    uint16 PAD;                /* 0xce8 */
    uint16 PAD;                /* 0xcea */
    uint16 PAD;                /* 0xcec */
    uint16 PAD;                /* 0xcee */
    uint16 PAD;                /* 0xcf0 */
    uint16 PAD;                /* 0xcf2 */
    uint16 PAD;                /* 0xcf4 */
    uint16 PAD;                /* 0xcf6 */
    uint16 PAD;                /* 0xcf8 */
    uint16 PAD;                /* 0xcfa */
    uint16 PAD;                /* 0xcfc */
    uint16 PAD;                /* 0xcfe */
    uint16 PAD;                /* 0xd00 */
    uint16 PAD;                /* 0xd02 */
    uint16 PAD;                /* 0xd04 */
    uint16 PAD;                /* 0xd06 */
    uint16 PAD;                /* 0xd08 */
    uint16 PAD;                /* 0xd0a */
    uint16 PAD;                /* 0xd0c */
    uint16 PAD;                /* 0xd0e */
    uint16 PAD;                /* 0xd10 */
    uint16 PAD;                /* 0xd12 */
    uint16 PAD;                /* 0xd14 */
    uint16 PAD;                /* 0xd16 */
    uint16 PAD;                /* 0xd18 */
    uint16 PAD;                /* 0xd1a */
    uint16 PAD;                /* 0xd1c */
    uint16 PAD;                /* 0xd1e */
    uint16 PAD;                /* 0xd20 */
    uint16 PAD;                /* 0xd22 */
    uint16 PAD;                /* 0xd24 */
    uint16 PAD;                /* 0xd26 */
    uint16 PAD;                /* 0xd28 */
    uint16 PAD;                /* 0xd2a */
    uint16 PAD;                /* 0xd2c */
    uint16 PAD;                /* 0xd2e */
    uint16 PAD;                /* 0xd30 */
    uint16 PAD;                /* 0xd32 */
    uint16 PAD;                /* 0xd34 */
    uint16 PAD;                /* 0xd36 */
    uint16 PAD;                /* 0xd38 */
    uint16 PAD;                /* 0xd3a */
    uint16 PAD;                /* 0xd3c */
    uint16 PAD;                /* 0xd3e */
    uint16 PAD;                /* 0xd40 */
    uint16 PAD;                /* 0xd42 */
    uint16 PAD;                /* 0xd44 */
    uint16 PAD;                /* 0xd46 */
    uint16 PAD;                /* 0xd48 */
    uint16 PAD;                /* 0xd4a */
    uint16 PAD;                /* 0xd4c */
    uint16 PAD;                /* 0xd4e */
    uint16 PAD;                /* 0xd50 */
    uint16 PAD;                /* 0xd52 */
    uint16 PAD;                /* 0xd54 */
    uint16 PAD;                /* 0xd56 */
    uint16 PAD;                /* 0xd58 */
    uint16 PAD;                /* 0xd5a */
    uint16 PAD;                /* 0xd5c */
    uint16 PAD;                /* 0xd5e */
    uint16 PAD;                /* 0xd60 */
    uint16 PAD;                /* 0xd62 */
    uint16 PAD;                /* 0xd64 */
    uint16 PAD;                /* 0xd66 */
    uint16 PAD;                /* 0xd68 */
    uint16 PAD;                /* 0xd6a */
    uint16 PAD;                /* 0xd6c */
    uint16 PAD;                /* 0xd6e */
    uint16 PAD;                /* 0xd70 */
    uint16 PAD;                /* 0xd72 */
    uint16 PAD;                /* 0xd74 */
    uint16 PAD;                /* 0xd76 */
    uint16 PAD;                /* 0xd78 */
    uint16 PAD;                /* 0xd7a */
    uint16 PAD;                /* 0xd7c */
    uint16 PAD;                /* 0xd7e */
    uint16 PAD;                /* 0xd80 */
    uint16 PAD;                /* 0xd82 */
    uint16 PAD;                /* 0xd84 */
    uint16 PAD;                /* 0xd86 */
    uint16 PAD;                /* 0xd88 */
    uint16 PAD;                /* 0xd8a */
    uint16 PAD;                /* 0xd8c */
    uint16 PAD;                /* 0xd8e */
    uint16 PAD;                /* 0xd90 */
    uint16 PAD;                /* 0xd92 */
    uint16 PAD;                /* 0xd94 */
    uint16 PAD;                /* 0xd96 */
    uint16 PAD;                /* 0xd98 */
    uint16 PAD;                /* 0xd9a */
    uint16 PAD;                /* 0xd9c */
    uint16 PAD;                /* 0xd9e */
    uint16 PAD;                /* 0xda0 */
    uint16 PAD;                /* 0xda2 */
    uint16 PAD;                /* 0xda4 */
    uint16 PAD;                /* 0xda6 */
    uint16 PAD;                /* 0xda8 */
    uint16 PAD;                /* 0xdaa */
    uint16 PAD;                /* 0xdac */
    uint16 PAD;                /* 0xdae */
    uint16 PAD;                /* 0xdb0 */
    uint16 PAD;                /* 0xdb2 */
    uint16 PAD;                /* 0xdb4 */
    uint16 PAD;                /* 0xdb6 */
    uint16 PAD;                /* 0xdb8 */
    uint16 PAD;                /* 0xdba */
    uint16 PAD;                /* 0xdbc */
    uint16 PAD;                /* 0xdbe */
    uint16 PAD;                /* 0xdc0 */
    uint16 PAD;                /* 0xdc2 */
    uint16 PAD;                /* 0xdc4 */
    uint16 PAD;                /* 0xdc6 */
    uint16 PAD;                /* 0xdc8 */
    uint16 PAD;                /* 0xdca */
    uint16 PAD;                /* 0xdcc */
    uint16 PAD;                /* 0xdce */
    uint16 PAD;                /* 0xdd0 */
    uint16 PAD;                /* 0xdd2 */
    uint16 PAD;                /* 0xdd4 */
    uint16 PAD;                /* 0xdd6 */
    uint16 PAD;                /* 0xdd8 */
    uint16 PAD;                /* 0xdda */
    uint16 PAD;                /* 0xddc */
    uint16 PAD;                /* 0xdde */
    uint16 PAD;                /* 0xde0 */
    uint16 PAD;                /* 0xde2 */
    uint16 PAD;                /* 0xde4 */
    uint16 PAD;                /* 0xde6 */
    uint16 PAD;                /* 0xde8 */
    uint16 PAD;                /* 0xdea */
    uint16 PAD;                /* 0xdec */
    uint16 PAD;                /* 0xdee */
    uint16 PAD;                /* 0xdf0 */
    uint16 PAD;                /* 0xdf2 */
    uint16 PAD;                /* 0xdf4 */
    uint16 PAD;                /* 0xdf6 */
    uint16 PAD;                /* 0xdf8 */
    uint16 PAD;                /* 0xdfa */
    uint16 PAD;                /* 0xdfc */
    uint16 PAD;                /* 0xdfe */
    uint16 PAD;                /* 0xe00 */
    uint16 PAD;                /* 0xe02 */
    uint16 PAD;                /* 0xe04 */
    uint16 PAD;                /* 0xe06 */
    uint16 PAD;                /* 0xe08 */
    uint16 PAD;                /* 0xe0a */
    uint16 PAD;                /* 0xe0c */
    uint16 PAD;                /* 0xe0e */
    uint16 PAD;                /* 0xe10 */
    uint16 PAD;                /* 0xe12 */
    uint16 PAD;                /* 0xe14 */
    uint16 PAD;                /* 0xe16 */
    uint16 PAD;                /* 0xe18 */
    uint16 PAD;                /* 0xe1a */
    uint16 PAD;                /* 0xe1c */
    uint16 PAD;                /* 0xe1e */
    uint16 PAD;                /* 0xe20 */
    uint16 PAD;                /* 0xe22 */
    uint16 PAD;                /* 0xe24 */
    uint16 PAD;                /* 0xe26 */
    uint16 PAD;                /* 0xe28 */
    uint16 PAD;                /* 0xe2a */
    uint16 PAD;                /* 0xe2c */
    uint16 PAD;                /* 0xe2e */
    uint16 PAD;                /* 0xe30 */
    uint16 PAD;                /* 0xe32 */
    uint16 PAD;                /* 0xe34 */
    uint16 PAD;                /* 0xe36 */
    uint16 PAD;                /* 0xe38 */
    uint16 PAD;                /* 0xe3a */
    uint16 PAD;                /* 0xe3c */
    uint16 PAD;                /* 0xe3e */
    uint16 PAD;                /* 0xe40 */
    uint16 PAD;                /* 0xe42 */
    uint16 PAD;                /* 0xe44 */
    uint16 PAD;                /* 0xe46 */
    uint16 PAD;                /* 0xe48 */
    uint16 PAD;                /* 0xe4a */
    uint16 PAD;                /* 0xe4c */
    uint16 PAD;                /* 0xe4e */
    uint16 PAD;                /* 0xe50 */
    uint16 PAD;                /* 0xe52 */
    uint16 PAD;                /* 0xe54 */
    uint16 PAD;                /* 0xe56 */
    uint16 PAD;                /* 0xe58 */
    uint16 PAD;                /* 0xe5a */
    uint16 PAD;                /* 0xe5c */
    uint16 PAD;                /* 0xe5e */
    uint16 PAD;                /* 0xe60 */
    uint16 PAD;                /* 0xe62 */
    uint16 PAD;                /* 0xe64 */
    uint16 PAD;                /* 0xe66 */
    uint16 PAD;                /* 0xe68 */
    uint16 PAD;                /* 0xe6a */
    uint16 PAD;                /* 0xe6c */
    uint16 PAD;                /* 0xe6e */
    uint16 PAD;                /* 0xe70 */
    uint16 PAD;                /* 0xe72 */
    uint16 PAD;                /* 0xe74 */
    uint16 PAD;                /* 0xe76 */
    uint16 PAD;                /* 0xe78 */
    uint16 PAD;                /* 0xe7a */
    uint16 PAD;                /* 0xe7c */
    uint16 PAD;                /* 0xe7e */
    uint16 PAD;                /* 0xe80 */
    uint16 PAD;                /* 0xe82 */
    uint16 PAD;                /* 0xe84 */
    uint16 PAD;                /* 0xe86 */
    uint16 PAD;                /* 0xe88 */
    uint16 PAD;                /* 0xe8a */
    uint16 PAD;                /* 0xe8c */
    uint16 PAD;                /* 0xe8e */
    uint16 PAD;                /* 0xe90 */
    uint16 PAD;                /* 0xe92 */
    uint16 PAD;                /* 0xe94 */
    uint16 PAD;                /* 0xe96 */
    uint16 PAD;                /* 0xe98 */
    uint16 PAD;                /* 0xe9a */
    uint16 PAD;                /* 0xe9c */
    uint16 PAD;                /* 0xe9e */
    uint16 PAD;                /* 0xea0 */
    uint16 PAD;                /* 0xea2 */
    uint16 PAD;                /* 0xea4 */
    uint16 PAD;                /* 0xea6 */
    uint16 PAD;                /* 0xea8 */
    uint16 PAD;                /* 0xeaa */
    uint16 PAD;                /* 0xeac */
    uint16 PAD;                /* 0xeae */
    uint16 PAD;                /* 0xeb0 */
    uint16 PAD;                /* 0xeb2 */
    uint16 PAD;                /* 0xeb4 */
    uint16 PAD;                /* 0xeb6 */
    uint16 PAD;                /* 0xeb8 */
    uint16 PAD;                /* 0xeba */
    uint16 PAD;                /* 0xebc */
    uint16 PAD;                /* 0xebe */
    uint16 PAD;                /* 0xec0 */
    uint16 PAD;                /* 0xec2 */
    uint16 PAD;                /* 0xec4 */
    uint16 PAD;                /* 0xec6 */
    uint16 PAD;                /* 0xec8 */
    uint16 PAD;                /* 0xeca */
    uint16 PAD;                /* 0xecc */
    uint16 PAD;                /* 0xece */
    uint16 PAD;                /* 0xed0 */
    uint16 PAD;                /* 0xed2 */
    uint16 PAD;                /* 0xed4 */
    uint16 PAD;                /* 0xed6 */
    uint16 PAD;                /* 0xed8 */
    uint16 PAD;                /* 0xeda */
    uint16 PAD;                /* 0xedc */
    uint16 PAD;                /* 0xede */
    uint16 PAD;                /* 0xee0 */
    uint16 PAD;                /* 0xee2 */
    uint16 PAD;                /* 0xee4 */
    uint16 PAD;                /* 0xee6 */
    uint16 PAD;                /* 0xee8 */
    uint16 PAD;                /* 0xeea */
    uint16 PAD;                /* 0xeec */
    uint16 PAD;                /* 0xeee */
    uint16 PAD;                /* 0xef0 */
    uint16 PAD;                /* 0xef2 */
    uint16 PAD;                /* 0xef4 */
    uint16 PAD;                /* 0xef6 */
    uint16 PAD;                /* 0xef8 */
    uint16 PAD;                /* 0xefa */
    uint16 PAD;                /* 0xefc */
    uint16 PAD;                /* 0xefe */
    uint16 PAD;                /* 0xf00 */
    uint16 PAD;                /* 0xf02 */
    uint16 PAD;                /* 0xf04 */
    uint16 PAD;                /* 0xf06 */
    uint16 PAD;                /* 0xf08 */
    uint16 PAD;                /* 0xf0a */
    uint16 PAD;                /* 0xf0c */
    uint16 PAD;                /* 0xf0e */
    uint16 PAD;                /* 0xf10 */
    uint16 PAD;                /* 0xf12 */
    uint16 PAD;                /* 0xf14 */
    uint16 PAD;                /* 0xf16 */
    uint16 PAD;                /* 0xf18 */
    uint16 PAD;                /* 0xf1a */
    uint16 PAD;                /* 0xf1c */
    uint16 PAD;                /* 0xf1e */
    uint16 PAD;                /* 0xf20 */
    uint16 PAD;                /* 0xf22 */
    uint16 PAD;                /* 0xf24 */
    uint16 PAD;                /* 0xf26 */
    uint16 PAD;                /* 0xf28 */
    uint16 PAD;                /* 0xf2a */
    uint16 PAD;                /* 0xf2c */
    uint16 PAD;                /* 0xf2e */
    uint16 PAD;                /* 0xf30 */
    uint16 PAD;                /* 0xf32 */
    uint16 PAD;                /* 0xf34 */
    uint16 PAD;                /* 0xf36 */
    uint16 PAD;                /* 0xf38 */
    uint16 PAD;                /* 0xf3a */
    uint16 PAD;                /* 0xf3c */
    uint16 PAD;                /* 0xf3e */
    uint16 PAD;                /* 0xf40 */
    uint16 PAD;                /* 0xf42 */
    uint16 PAD;                /* 0xf44 */
    uint16 PAD;                /* 0xf46 */
    uint16 PAD;                /* 0xf48 */
    uint16 PAD;                /* 0xf4a */
    uint16 PAD;                /* 0xf4c */
    uint16 PAD;                /* 0xf4e */
    uint16 PAD;                /* 0xf50 */
    uint16 PAD;                /* 0xf52 */
    uint16 PAD;                /* 0xf54 */
    uint16 PAD;                /* 0xf56 */
    uint16 PAD;                /* 0xf58 */
    uint16 PAD;                /* 0xf5a */
    uint16 PAD;                /* 0xf5c */
    uint16 PAD;                /* 0xf5e */
    uint16 PAD;                /* 0xf60 */
    uint16 PAD;                /* 0xf62 */
    uint16 PAD;                /* 0xf64 */
    uint16 PAD;                /* 0xf66 */
    uint16 PAD;                /* 0xf68 */
    uint16 PAD;                /* 0xf6a */
    uint16 PAD;                /* 0xf6c */
    uint16 PAD;                /* 0xf6e */
    uint16 PAD;                /* 0xf70 */
    uint16 PAD;                /* 0xf72 */
    uint16 PAD;                /* 0xf74 */
    uint16 PAD;                /* 0xf76 */
    uint16 PAD;                /* 0xf78 */
    uint16 PAD;                /* 0xf7a */
    uint16 PAD;                /* 0xf7c */
    uint16 PAD;                /* 0xf7e */
    uint16 PAD;                /* 0xf80 */
    uint16 PAD;                /* 0xf82 */
    uint16 PAD;                /* 0xf84 */
    uint16 PAD;                /* 0xf86 */
    uint16 PAD;                /* 0xf88 */
    uint16 PAD;                /* 0xf8a */
    uint16 PAD;                /* 0xf8c */
    uint16 PAD;                /* 0xf8e */
    uint16 PAD;                /* 0xf90 */
    uint16 PAD;                /* 0xf92 */
    uint16 PAD;                /* 0xf94 */
    uint16 PAD;                /* 0xf96 */
    uint16 PAD;                /* 0xf98 */
    uint16 PAD;                /* 0xf9a */
    uint16 PAD;                /* 0xf9c */
    uint16 PAD;                /* 0xf9e */
    uint16 PAD;                /* 0xfa0 */
    uint16 PAD;                /* 0xfa2 */
    uint16 PAD;                /* 0xfa4 */
    uint16 PAD;                /* 0xfa6 */
    uint16 PAD;                /* 0xfa8 */
    uint16 PAD;                /* 0xfaa */
    uint16 PAD;                /* 0xfac */
    uint16 PAD;                /* 0xfae */
    uint16 PAD;                /* 0xfb0 */
    uint16 PAD;                /* 0xfb2 */
    uint16 PAD;                /* 0xfb4 */
    uint16 PAD;                /* 0xfb6 */
    uint16 PAD;                /* 0xfb8 */
    uint16 PAD;                /* 0xfba */
    uint16 PAD;                /* 0xfbc */
    uint16 PAD;                /* 0xfbe */
    uint16 PAD;                /* 0xfc0 */
    uint16 PAD;                /* 0xfc2 */
    uint16 PAD;                /* 0xfc4 */
    uint16 PAD;                /* 0xfc6 */
    uint16 PAD;                /* 0xfc8 */
    uint16 PAD;                /* 0xfca */
    uint16 PAD;                /* 0xfcc */
    uint16 PAD;                /* 0xfce */
    uint16 PAD;                /* 0xfd0 */
    uint16 PAD;                /* 0xfd2 */
    uint16 PAD;                /* 0xfd4 */
    uint16 PAD;                /* 0xfd6 */
    uint16 PAD;                /* 0xfd8 */
    uint16 PAD;                /* 0xfda */
    uint16 PAD;                /* 0xfdc */
    uint16 PAD;                /* 0xfde */
    uint16 PAD;                /* 0xfe0 */
    uint16 PAD;                /* 0xfe2 */
    uint16 PAD;                /* 0xfe4 */
    uint16 PAD;                /* 0xfe6 */
    uint16 PAD;                /* 0xfe8 */
    uint16 PAD;                /* 0xfea */
    uint16 PAD;                /* 0xfec */
    uint16 PAD;                /* 0xfee */
    uint16 PAD;                /* 0xff0 */
    uint16 PAD;                /* 0xff2 */
    uint16 PAD;                /* 0xff4 */
    uint16 PAD;                /* 0xff6 */
    uint16 PAD;                /* 0xff8 */
    uint16 PAD;                /* 0xffa */
    uint16 PAD;                /* 0xffc */
    uint16 PAD;                /* 0xffe */
} __attribute__((packed));

struct ethernet_header {
    uint8 dst[6];
    uint8 src[6];
    uint16 type;
} __attribute__((packed));

struct ipv6_header {
    uint32 version_traffic_class_flow_label;
    uint16 payload_length;
    uint8 next_header;
    uint8 hop_limit;
    uint8 src_ip[16];
    uint8 dst_ip[16];
} __attribute__((packed));

struct ip_header {
    uint8 version_ihl;
    uint8 dscp_ecn;
    uint16 total_length;
    uint16 identification;
    uint16 flags_fragment_offset;
    uint8 ttl;
    uint8 protocol;
    uint16 header_checksum;
    union {
        uint32 integer;
        uint8 array[4];
    } src_ip;
    union {
        uint32 integer;
        uint8 array[4];
    } dst_ip;
} __attribute__((packed));

struct udp_header {
    uint16 src_port;
    uint16 dst_port;
    union {
        uint16 length;
        uint16 checksum_coverage;
    } len_chk_cov;
    uint16 checksum;
} __attribute__((packed));

